Documents/АР_АктПриемаВозвратаАрендуемогоПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР_АктПриемаВозвратаАрендуемогоПомещения</Name>
			<BasedOn>
				<xr:Item>Document.АР_АктПриемаПередачиПомещенияВАренду</xr:Item>
				<xr:Item>Document.АР17_РасторжениеДоговораАренды</xr:Item>
				<xr:Item>Document.АР17_ДополнительноеСоглашение</xr:Item>
				<xr:Item>Document.АР17_ЗаключениеДоговораАренды</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_ПереданныеДокументы</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.АР_СостояниеОбъектов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация-арендодатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПроводки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_РасторжениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаПередачиПомещенияВАренду</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_Москва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_СанктПетербург</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возвращен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_СтатусДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выехал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АР_ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_ШтрихКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/АР_СтатусДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>АР_СтатусДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписанСкан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АР_АктПриемаВозвратаАрендуемогоПомещения/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьДокументПоОснованиюНаСервере()
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьДокументПоОснованию();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Элементы.СоставОсновноеСредство.Видимость = Объект.ФормироватьПроводки;
	Элементы.СоставСумма.Видимость = Объект.ФормироватьПроводки;
	Элементы.СчетУчетаБУ.Видимость = Объект.ФормироватьПроводки;
	
	// + NAI Becar Комментирование Смирнов А.А. от 05.09.2017 12:46
	Если АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_МенеджерПоАренде") И Не АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_Руководитель,АР_ФинансовыйМенеджер") Тогда
		Если СокрЛП(Объект.Статус) = "Согласован" Тогда
			Форма.ТолькоПросмотр = НЕ АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
		Иначе
			Форма.ТолькоПросмотр = Ложь;
			Элементы.Статус.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);

	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда //ЭтоНовый
		Объект.Статус = Перечисления.АР_СтатусДоговора.Проект;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьДокументПоОснованию(Команда)
	
	ЗаполнитьДокументПоОснованиюНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ФормироватьПроводкиПриИзменении(Элемент)
	
	Если Объект.ФормироватьПроводки Тогда
		Если Не ЗначениеЗаполнено(Объект.СчетУчетаБУ) Тогда
			Объект.СчетУчетаБУ = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ОсновныеСредстваСданныеВАренду");
		КонецЕсли;
	КонецЕсли;
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ЗаполнитьДокументПоОснованиюНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// + Рогачев  Андрей от 28.11.2016  № 118003
	
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
	
	Если ТекущийОбъект.Состав.Количество()=0 Тогда
		ТекстСообщения = Нстр("ru = 'Документ не сохранен. Заполните состав табличной части.'");
		//бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		
		Отказ=Истина;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ПослеЗаписиАктаПВ",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
// + Рогачев  Андрей от 14.06.2016  № 103091
&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
		//Вставить содержимое обработчика
			Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.СсылкаНаОбъект КАК Ссылка,
	|	ШтрихКоды.ШтрихКод КАК ШК
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.СсылкаНаОбъект = &СсылкаНаОбъект";
	//|	ШтрихКоды.ШтрихКод ПОДОБНО &ШтрихКод";
	//Запрос.УстановитьПараметр("ШтрихКод","%" + СтрШК + "%");
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("СсылкаНаОбъект",ЭтаФорма.Объект.Ссылка);
	//МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШК");
	
	Если МассивСсылок.Количество() = 1 Тогда

	ЭтотОбъект.ШК= МассивСсылок[0];
	КонецЕсли;
	// + Рогачев  Андрей от 07.10.2016  № 113609
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный =ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры

// + NAI Becar Комментирование Смирнов А.А. от 15.12.2016 14:07
&НаКлиенте
Процедура СоставПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ОбъектАренды) Тогда
		Если Не ЭтоПомещение(Элемент.ТекущиеДанные.ОбъектАренды) Тогда
			Пом = ПолучитьПомещения(Элемент.ТекущиеДанные.ОбъектАренды);
			Объект.Состав.Удалить(Элемент.ТекущиеДанные.НомерСтроки-1);
			//Объект.ОбъектыАренды.Очистить();//.Удалить(Объект.ОбъектыАренды[Элемент.ТекущиеДанные.НомерСтроки-1]);
			Для Каждого СтрПом из Пом Цикл
				НовоеПом = Объект.Состав.Добавить();
				НовоеПом.ОбъектАренды = СтрПом;
				НовоеПом.Площадь = ПолучитьПлощадьОбщая(СтрПом);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
	//Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ОбъектАренды) Тогда
	//	Элемент.ТекущиеДанные.Площадь = ПолучитьПлощадьОбщая(Элемент.ТекущиеДанные.ОбъектАренды);
	//КонецЕсли;

КонецПроцедуры

Функция ЭтоПомещение(ОбъектАренды)
	 Возврат ОбъектАренды.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Помещение;
КонецФункции	

Функция  ПолучитьПомещения(Родитель)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ОбъектыАренды.Ссылка
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Родитель В ИЕРАРХИИ(&Родитель)
	               |	И АР_ОбъектыАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.Помещение)";
	Запрос.УстановитьПараметр("Родитель",Родитель);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	МассивСсылок = Выгрузка.ВыгрузитьКолонку("Ссылка");
	Возврат МассивСсылок;
КонецФункции

Функция ПолучитьПлощадьОбщая(ТекущиеДанные)
	Возврат ТекущиеДанные.ПолучитьОбъект().ЗначениеХарактеристики;
КонецФункции	
// - NAI Becar Комментирование Смирнов А.А.

// + NAI Becar Конюшок С.Н. от 09.01.2017 12:09 
&НаСервере
Функция ПолучитьПлощадь(СпрОбъектАренды)
	Возврат СпрОбъектАренды.ЗначениеХарактеристики;
КонецФункции

&НаКлиенте
Процедура СоставОбъектАрендыПриИзменении(Элемент)
	
	ТекСтр = Элементы.Состав.ТекущиеДанные;
	ТекСтр.Площадь = ПолучитьПлощадь(ТекСтр.ОбъектАренды);
	
КонецПроцедуры

&НаСервере
Функция ПоискИКПоДоговору()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР17_ЗаключениеДоговораАренды.ИК
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|ГДЕ
		|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И АР17_ЗаключениеДоговораАренды.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат РЗ.ИК;
	КонецЕсли; 

КонецФункции // ПоискИКПоДоговору()

&НаКлиенте
Процедура СоставОбъектАрендыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ИКДоговора = ПоискИКПоДоговору();
		Если ИКДоговора <> Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыОбъекты = Новый Структура("ИК",ИКДоговора);
			ОткрытьФорму("Справочник.АР_ОбъектыАренды.ФормаВыбора", ПараметрыОбъекты, Элемент);
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры
// - NAI Becar Конюшок С.Н. 
 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНЫХ ЧАСТЕЙ
